[
  {
    "id": 1,
    "displayName": "sur mesure",
    "iconUrl": "./assets/icons/sur-mesure-icon.svg",
    "motivation": "PROFESSIONAL",
    "description": "Sur Mesure est un projet d'application mobile ayant pour objectif de contacter des personnes éloignées de l'emploi et leur proposer des solutions adaptées à leurs besoins et problématiques, que ce soit pour reprendre un emploi ou suivre une formation. J'ai tout d'abord participé à la création de l'identité visuelle du projet, puis j'ai réalisé les premières maquettes de l'application. Étant curieux de savoir si celles-ci étaient réalisables et vu la simplicité du projet qui consistait en un simple questionnaire, j'ai décidé de m'immiscer dans le développement de l'application. Avec l'aide de mes collègues, j'ai pu réaliser la première version de Sur Mesure sur Android. J'ai utilisé les outils tels que Ionic, Firebase, Material Design et Lottie pour suivre toutes les étapes de développement, depuis le premier brief jusqu'à la mise en ligne sur le Play Store (et plus tard sur l'App Store).",
    "imgUrl": "./assets/img/projects/sur-mesure-mockup.png",
    "skillsId": [0, 7, 5],
    "screenshots": [
      "https://imgur.com/0woSwUR.jpg",
      "https://imgur.com/NJmzXN8.jpg",
      "https://imgur.com/ilB2zul.jpg",
      "https://imgur.com/2Ai9hWi.jpg",
      "https://imgur.com/0L9d900.jpg"
    ],
    "color": "#75B1DE",
    "links":[
      {
        "name":"voir sur l'app store",
        "link":"https://apps.apple.com/ci/app/sur-mesure/id1624893049"
      },
      {
        "name":"voir sur le play store",
        "link":"https://play.google.com/store/apps/datasafety?id=sur.mesure.app&hl=en_GB&gl=US"
      }
    ]
  },

  {
    "id": 2,
    "displayName": "Sutom-Master",
    "motivation": "PERSONAL",
    "description": "Avec des ami(e)s et des collègues, nous avons l'habitude de jouer au Sutom. Si vous ne connaissez pas le Sutom, c'est un jeu en ligne de type Motus dans lequel tout le monde doit découvrir un mot avec le moins d'essais possible, et chaque jour le mot change. Nous partageons souvent nos performances sur un canal Discord dédié où chacun clame haut et fort qu'il est le meilleur ! C'est là que m'est venue l'idée : si je crée un bot qui compte les scores de chacun, il pourrait nous dire qui est le meilleur chaque mois et qui a réalisé le meilleur score cette semaine. C'est ainsi qu'est né ce projet, et c'est exactement ce qu'il fait aujourd'hui, avec quelques fonctionnalités que je vous laisse découvrir. J'ai développé ce bot en Java, en utilisant l'API Java de Discord (JDA). La base de données a été développée par un ami en PHP avec Symfony.",
    "imgUrl": "https://i.notretemps.com/1800x0/smart/2019/10/28/thierry-beccaro-jai-choisi-le-sourire-et-la-vie.jpg",
    "gitUrl": "https://github.com/PierreGaillot/sutom-master",
    "iconUrl":"./assets/icons/sutom-master-icon.svg",
    "skillsId": [2, 5, 1],
    "screenshots": [
      "https://imgur.com/XDg3s37.jpg",
      "https://imgur.com/MTjBWLV.jpg",
      "https://imgur.com/ipS9uk6.jpg"
    ],
    "color":"#F2BF3D",
    "links":[
      {
        "name":"voir le Help sur notion",
        "link":"https://www.notion.so/SutomHelp-d88fb109f35f4b84a4e101eaa6f90033?pvs=4"
      }
    ]
  },

  {
    "id": 3,
    "displayName": "Médiatio",
    "motivation": "PROFESSIONAL",
    "iconUrl": "./assets/icons/mediatio-icon.png",
    "description": "Mediatio est un projet d'application mobile imaginé chez LevelUp Cluster. Son objectif est de mettre en relation des personnes éloignées du numérique avec des conseillers numériques proches d'eux, en utilisant un chat pour répondre à leurs questions et en leur proposant de participer à des ateliers. Par exemple, les aider à remplir leur déclaration d'impôt en ligne ou à envoyer un e-mail. J'ai réalisé toutes les maquettes et prototypes de ce projet sur Figma, ainsi que sa charte graphique.",
    "imgUrl": "./assets/img/projects/mediatio.png",
    "skillsId": [0],
    "screenshots": [
      "https://imgur.com/x0XotVF.jpg",
      "https://imgur.com/bayZKSl.jpg",
      "https://imgur.com/neTXoNo.jpg",
      "https://imgur.com/361Grz1.jpg"
    ],
    "color": "#7B00FF"
  },

  {
    "id": 4,
    "displayName": "The Trap Test",
    "motivation": "PERSONAL",
    "description": "J'aime comprendre le fonctionnement des choses, et bien avant de me lancer dans le développement, je me suis souvent demandé comment fonctionnait un jeu vidéo. Qu'arrive-t-il réellement lorsque l'on ramasse un objet ou que l'on ouvre notre inventaire ? Ce sont des questions essentielles qui méritent des réponses. C'est pourquoi j'ai commencé par installer Unity, un moteur de jeu gratuit sur lequel de nombreux jeux de renom ont été développés, et j'ai commencé à coder de petites choses en C++. Au fil du temps, j'ai voulu créer mon propre petit jeu afin de mieux comprendre leur fonctionnement. Mon ambition n'était pas de sortir et de révolutionner le monde des jeux vidéo, mais plutôt de m'entraîner à mieux comprendre leur fonctionnement. Pour cela, j'ai eu besoin de plusieurs choses : un moteur de jeu (j'ai finalement opté pour Unreal Engine, qui était plus simple à prendre en main), un style de plateformer 2D en pixel, des assets pour gagner du temps sur les graphismes (mon personnage, ses animations, les objets qu'il ramasse), une histoire et un univers, de la musique, mais surtout de l'organisation. J'ai créé tous les éléments graphiques sur Photoshop, le code (après de multiples refontes) a été géré avec Unreal Engine, et les recherches et l'organisation sur Miro. Ce projet a été réalisé sur le long terme, mais grâce à mon acharnement, j'ai finalement réussi à faire ce que je voulais. Mon jeu raconte l'histoire d'un jeune Aztèque qui travaille comme testeur de pièges dans un temple.",
    "imgUrl": "https://imgur.com/x8KEerE.jpg",
    "iconUrl":"https://imgur.com/hasy4ZU.gif",
    "skillsId": [8, 3, 9],
    "screenshots": [
      "https://imgur.com/hasy4ZU.gif",
      "https://imgur.com/4xtsAFu.gif",
      "https://imgur.com/Xdls59i.gif",
      "https://imgur.com/zx58sfV.gif",
      "https://imgur.com/Vh14w7f.gif",
      "https://imgur.com/NzwCIqI.gif",
      "https://imgur.com/jAPoNG3.gif",
      "https://imgur.com/HLM0p4m.gif",
      "https://imgur.com/UvASj5O.gif",
      "https://imgur.com/3Unugv9.gif",
      "https://imgur.com/GLAHdOS.jpg"
    ]
  },

  {
    "id": 5,
    "displayName": "Go4Lunch",
    "motivation": "FORMATION",
    "description": "Dans le cadre de ma formation de développeur d'applications Android, j'ai créé plusieurs applications pour m'exercer, dont Go4Lunch, qui est un excellent exemple de mon travail. L'objectif de cette application est de permettre aux employés d'une même entreprise de s'informer sur les lieux où ils peuvent déjeuner afin d'organiser leur temps de manière plus efficace.J'ai développé l'ensemble de l'application en utilisant le langage de programmation Java, ainsi que les API de Google, notamment Google Place et Google Maps. J'ai également utilisé les services de Firebase pour l'authentification des utilisateurs et le stockage des données.",
    "imgUrl": "https://i.imgur.com/HlOskof.png",
    "skillsId": [2, 5, 3, 9],
    "gitUrl": "https://github.com/PierreGaillot/Go4Lunch"
  },
  {
    "id": 6,
    "displayName": "Peintures & dessins",
    "motivation": "PERSONAL",
    "description": "Comme vous avez peut-être pu le constater sur ce site, j'ai suivi des études dans les domaines de l'art, du graphisme et de la mise en page. Je suis passionné par la création et l'imagination, et j'aime concrétiser mes idées en les matérialisant. Cela commence souvent par la réalisation d'un croquis, d'un petit dessin ou même d'une aquarelle.",
    "imgUrl": "https://i.redd.it/3d46mrwwba901.png",
    "skillsId": [3, 4],
    "screenshots": [
      "https://i.imgur.com/nz55WgO.png",
      "https://i.imgur.com/GoM7Y8U.png",
      "https://i.imgur.com/r9XNbOQ.jpg",
      "https://i.imgur.com/QcBJ69e.jpg",
      "https://i.imgur.com/5ZrVIUX.jpg",
      "https://i.imgur.com/edjlmXc.jpg",
      "https://i.imgur.com/iqgvp2m.jpg"
    ]
  },
  {
    "id": 7,
    "displayName": "Urbanesse AR",
    "motivation": "PROFESSIONAL",
    "description": "Le projet Urbanesse a été développé conjointement par Essteam et LevelUp Cluster. Urbanesse est un jeu de plateau où les habitants d'un quartier collaborent pour trouver la meilleure solution pour réhabiliter un lieu. Les joueurs placent des tuiles représentant des éléments de mobilier urbain sur le plateau de jeu. Au début du projet, j'étais impliqué en tant que graphiste et j'ai participé à la réalisation de certains visuels, y compris le logo. J'ai ensuite eu l'idée d'améliorer l'expérience de jeu en rendant le plateau de jeu plus interactif grâce à la réalité augmentée. L'idée était de faire apparaître en réalité augmentée des informations ainsi qu’un model 3d de l’élément vidée sur chaque élément de tuile. J'ai travaillé sur ce projet pendant quelques semaines et j'ai réussi à réaliser un prototype convaincant. Cependant, la qualité de la caméra des téléphones utilisés et la puissance de calcul limitaient la capacité à afficher suffisamment d'éléments sur le plateau de jeu simultanément.",
    "imgUrl": "https://imgur.com/LFxNcLq.jpg",
    "skillsId": [8],
    "screenshots": [
      "https://imgur.com/dIXywgP.jpg",
      "https://imgur.com/LFxNcLq.jpg",
      "https://imgur.com/wU2f2gn.jpg",
      "https://imgur.com/CdNPlaG.jpg",
      "https://imgur.com/eso5HuN.jpg",
      "https://imgur.com/ojvHwyd.jpg",
      "https://imgur.com/TWAr6hE.jpg"
    ]
  },
  {
    "id": 8,
    "displayName": "PierreGaillot.fr",
    "motivation": "PERSONAL",
    "description": "J'ai souhaité refaire mon CV afin de mieux communiquer mes compétences en tant que développeur front-end. Pour ce faire, j'ai décidé de le refaire entièrement avec Angular, permettant ainsi une navigation rapide et simple vers les projets et compétences qui vous intéressent. Le code du CV est disponible sur GitHub.",
    "imgUrl": "https://imgur.com/WUwTtZQ.jpg",
    "skillsId": [6, 5],
    "gitUrl":"https://github.com/PGaillot/pierreGaillot.fr",
    "screenshots": ["https://imgur.com/WUwTtZQ.jpg"]
  },
  {
    "id": 9,
    "displayName": "CSC 2.0",
    "motivation": "PROFESSIONAL",
    "description": "Le projet CSC 2.0 a pour objectif de simplifier l'accueil et la gestion des ateliers dans les centres sociaux connectés. Les adhérents peuvent se connecter avec une carte à une borne située dans le centre social et s'inscrire, ainsi que d'autres membres de leur foyer, aux activités prévues. L'application comprend un back-office pour l'administration permettant de gérer les inscriptions des utilisateurs et la gestion des ateliers. J'ai réalisé les maquettes et prototypes du projet en collaboration avec les centres sociaux, grâce à Figma. Ensuite, le développement du projet front-end a été réalisé avec Angular et Material Design, tandis qu'un collègue a développé la base de données en PHP avec Symfony.",
    "imgUrl": "https://imgur.com/QOJXddl.jpg",
    "skillsId": [0, 6, 5],
    "screenshots": [
      "https://imgur.com/sZJS9Tz.jpg",
      "https://imgur.com/QOJXddl.jpg"
    ]
  },
  {
    "id": 10,
    "displayName": "Reviens",
    "motivation": "PERSONAL",
    "iconUrl": "./assets/icons/reviens.svg",
    "description": "Reviens est un projet personnel que je développe depuis un certain temps, dans le but de m'améliorer dans le développement d'applications Android. Il est développé grâce à Android Studio et utilise les services de Firebase pour répondre à une problématique de la vie quotidienne. Il m'arrive souvent de prêter un objet à une personne et d'oublier à qui je l'ai prêté. Personne n'aime rappeler à quelqu'un qu'il doit rendre un objet qui lui a été prêté. C'est pourquoi cette application a été créée pour permettre aux utilisateurs de se connecter, d'ajouter des objets à leur collection, de les prêter à d'autres utilisateurs, d'être informés quand un objet doit être rendu prochainement, et de relancer la personne à qui l'objet a été prêté avec une notification. Bien sûr, Reviens pourrait offrir bien d'autres fonctionnalités, mais l'application est encore en développement !",
    "imgUrl": "https://imgur.com/E6Hj855.jpg",
    "skillsId": [0, 2, 5],
    "screenshots": [
      "https://imgur.com/NmbN3jp.jpg",
      "https://imgur.com/A0ID49E.jpg",
      "https://imgur.com/X14aZta.jpg",
      "https://imgur.com/Pgu76ik.jpg",
      "https://imgur.com/RnKOG0I.jpg"
    ],
    "color": "#6929B2",
    "gitUrl":"https://github.com/PierreGaillot/Revient"
  },
  {
    "id": 11,
    "displayName": "PTEM",
    "motivation": "PROFESSIONAL",
    "iconUrl": "./assets/icons/ptem-icon.png",
    "description": "Le projet Ptem, prends toi en main, sur lequel j'ai collaboré chez LevelUp cluster pour l'Association pour le Développement de l'Education Permanente (Adep-roubaix), vise à fournir une éducation populaire et permanente en permettant à tous d'accéder aux savoirs de base et à la culture. L'application permet aux apprenants de suivre leur progression dans un parcours défini avec leur mentor et de débloquer des cadeaux à chaque étape validée. J'ai travaillé en étroite collaboration avec le client sur la conception des maquettes et des prototypes. Nous avons décidé de créer une première version simplifiée pour définir l'architecture du projet. L'application est développée en TypeScript avec Ionic, tandis que les prototypes ont été réalisés sur Figma. Les graphismes ont été créés par un graphiste collègue, tandis que l'API et la base de données ont été développées en PHP avec Symfony par un autre collègue.",
    "imgUrl": "https://imgur.com/5gM0sOp.jpg",
    "skillsId": [0, 7, 5],
    "screenshots": ["https://imgur.com/AtCrEue.jpg"]
  }
]
