[
  {
    "id":0,
    "displayName": "figma",
    "iconUrl": "https://upload.wikimedia.org/wikipedia/commons/3/33/Figma-logo.svg",
    "category": "design",
    "level": 90,
    "color":"#1ABCFE",
    "description": "Figma est une application de conception d'interface permettant de créer des maquettes, des prototypes et des designs de haute qualité pour des applications mobiles et des sites web. Au cours des deux dernières années, j'ai acquis une grande expertise dans l'utilisation régulière de Figma pour concevoir diverses interfaces visuelles et interactives. J'ai également eu l'occasion de former d'autres personnes à son utilisation et de les aider à comprendre ses fonctionnalités. En somme, Figma n'a quasiment plus aucun secret pour moi."
  },
  {
    "id":1,
    "displayName": "notion",
    "iconUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e9/Notion-logo.svg/langfr-800px-Notion-logo.svg.png",
    "category": "productivité",
    "level": 90,
    "description": "Notion est une plateforme de productivité en ligne, qui permet de créer des bases de données, des tableaux, des to-do lists, des notes, des wikis et bien plus encore. Elle permet également de collaborer facilement avec d'autres personnes sur des projets en temps réel. Je suis un utilisateur régulier de Notion depuis plusieurs années et j'ai acquis une grande expérience dans l'utilisation de cette plateforme pour organiser mes tâches et mes projets. J'ai créé des bases de données pour suivre mes objectifs de carrière, mes livres à lire, mes idées de projets et bien plus encore. J'ai également utilisé Notion pour gérer des projets en équipe, en collaborant avec des collègues pour suivre l'avancement des tâches et partager des informations importantes en temps réel. Notion est devenu un outil indispensable pour moi et je suis convaincu de sa capacité à aider tout le monde à être plus efficace et organisé dans leur travail quotidien."
  },
  {
    "id":2,
    "displayName": "java",
    "iconUrl": "https://upload.wikimedia.org/wikipedia/fr/thumb/2/2e/Java_Logo.svg/270px-Java_Logo.svg.png",
    "category": "dev",
    "level": 90,
    "color":"#ea2d2e",
    "description": "Java est un langage de programmation très répandu et polyvalent qui permet le développement d'applications dans divers domaines tels que le web, les jeux, les applications mobiles et de bureau, et bien plus encore. Bien que je ne sois pas un expert en programmation Java, j'ai une connaissance de base du langage et de ses concepts clés. J'ai suivi des cours et des tutoriels en ligne pour apprendre les fondamentaux de la programmation Java, et j'ai également suivi une formation sur la plateforme Open Class Rooms pour devenir développeur d'applications Android en Java. En outre, j'ai travaillé sur plusieurs projets en Java, notamment la création de bots Discord et d'applications Android. Bien que mes compétences en programmation Java soient encore en développement, je suis motivé pour continuer à apprendre et à progresser dans ce domaine. Je suis très enthousiaste à l'idée de continuer à développer mes compétences en programmation Java et d'en apprendre davantage sur ce langage versatile et puissant."
  },
  {
    "id":3,
    "displayName": "photoshop",
    "iconUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/af/Adobe_Photoshop_CC_icon.svg/langfr-1024px-Adobe_Photoshop_CC_icon.svg.png",
    "category": "design",
    "level": 90,
    "color":"#2da9ff",
    "description": "Photoshop est un logiciel de traitement d'image indispensable pour tout graphiste. Il permet de créer, d'éditer et de manipuler des images pour une utilisation dans divers domaines tels que la photographie, le graphisme, la publicité et bien plus encore. J'ai découvert les capacités de Photoshop lors de mes études en graphisme et j'ai perfectionné mes compétences lors de mes expériences professionnelles en tant que graphiste. Je l'utilise également pour la 'peinture numérique' afin de créer des œuvres d'art numériques. Au cours de mes différentes expériences professionnelles, j'ai également eu l'occasion de former d'autres personnes aux bases de Photoshop, notamment la retouche colorimétrique, le détourage et le montage."
  },
  {
    "id":4,
    "displayName": "illustrator",
    "iconUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fb/Adobe_Illustrator_CC_icon.svg/langfr-1024px-Adobe_Illustrator_CC_icon.svg.png",
    "category": "design",
    "level": 90,
    "color":"#ff9b00",
    "description": "Illustrator est un logiciel de dessin vectoriel très populaire qui est utilisé par de nombreux designers pour créer des illustrations, des logos, des icônes et des graphiques. Il permet de créer des designs précis et de haute qualité pour une utilisation dans différents domaines tels que la publicité, l'édition, la création de sites web, et plus encore. J'ai découvert les capacités d'Illustrator lors de mes études en design graphique et j'ai continué à l'utiliser régulièrement dans mes projets professionnels. J'ai développé une grande expertise dans l'utilisation de cet outil, et je suis capable de créer des designs précis et créatifs pour répondre aux besoins de mes clients. J'ai également eu l'opportunité de former d'autres personnes à l'utilisation d'Illustrator et de les aider à comprendre les fonctionnalités clés du logiciel. Je suis convaincu que la maîtrise d'Illustrator est un atout essentiel pour tout designer."
  },
  {
    "id":5,
    "displayName": "github",
    "iconUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/91/Octicons-mark-github.svg/900px-Octicons-mark-github.svg.png",
    "category": "dev",
    "level": 90,
    "description": "Github est une plateforme de développement de logiciels en ligne très populaire utilisée par des millions de développeurs dans le monde entier. Elle permet de stocker, partager et collaborer sur des projets de logiciels open source et privés. Au cours de mes expériences professionnelles en tant que développeur, j'ai appris à utiliser Github pour gérer efficacement mes projets de développement de logiciels. J'ai créé et contribué à divers des projets privés avec des équipes de développement. Je suis capable d'utiliser les fonctionnalités avancées de Github, telles que la gestion des branches, les demandes de fusion, les problèmes et les projets. En résumé, Github est une plateforme essentielle pour tout développeur de logiciels qui souhaite travailler de manière collaborative et efficace. Je suis motivé pour continuer à apprendre et à utiliser les fonctionnalités avancées de Github pour améliorer ma productivité et contribuer à la communauté de développement de logiciels open source."
  },
  {
    "id":6,
    "displayName": "angular",
    "iconUrl": "https://upload.wikimedia.org/wikipedia/commons/c/cf/Angular_full_color_logo.svg",
    "category": "dev",
    "level": 90,
    "color":"#dd0031",
    "description": "Angular est un framework JavaScript largement utilisé pour le développement d'applications Web modernes. Il offre des fonctionnalités avancées pour créer des applications Web dynamiques, interactives et réactives à l'aide de composants, de services, de directives et d'autres fonctionnalités. Au fil de mes expériences en tant que développeur Web, j'ai acquis une solide expertise dans l'utilisation d'Angular. J'ai conçu et développé plusieurs applications Web complexes, notamment des tableaux de bord de données, des back office, et même des jeux, en utilisant les meilleures pratiques d'Angular. Je suis capable de concevoir des architectures d'applications efficaces et de développer des composants et des services personnalisés pour améliorer la modularité et la maintenabilité du code. Je suis également à l'aise avec les outils et technologies liés à Angular, tels que TypeScript, RxJS, Webpack, Material Design et Angular CLI. Je reste toujours en veille sur les dernières fonctionnalités et pratiques pour améliorer mes compétences en Angular et fournir des solutions innovantes pour les problèmes de développement Web."
  },
  {
    "id":7,
    "displayName": "ionic",
    "iconUrl": "https://upload.wikimedia.org/wikipedia/commons/c/cf/LogoIonic.png",
    "category": "dev",
    "level": 90,
    "color":"#4e8ef7",
    "description": "Ionic est un framework de développement d'applications mobiles hybrides basé sur Angular et utilisant des technologies web telles que HTML, CSS et JavaScript. Il permet de créer des applications mobiles performantes et réactives pour iOS, Android et le web. Au cours de mes expériences professionnelles en tant que développeur d'applications mobiles, j'ai travaillé avec Ionic pour créer plusieurs applications mobiles à la fois pour iOS et Android. J'ai utilisé les fonctionnalités d'Ionic telles que les composants, les directives et les services pour développer des applications mobiles avec une interface utilisateur attrayante et des fonctionnalités avancées. Je suis toujours à la recherche de nouvelles fonctionnalités et de meilleures pratiques pour améliorer mes compétences en Ionic et fournir des solutions mobiles de haute qualité."
  },
  {
    "id":8,
    "displayName": "unreal engine",
    "iconUrl": "https://upload.wikimedia.org/wikipedia/commons/2/20/UE_Logo_Black_Centered.svg",
    "category": "dev",
    "level": 90,
    "description": "Unreal Engine est un moteur de jeu gratuit qui permet le développement de jeux vidéo sur différentes plateformes telles que les consoles de jeux, les ordinateurs, les appareils mobiles et les casques de réalité virtuelle. En autodidacte, j'ai choisi d'apprendre à utiliser Unreal Engine pour mieux comprendre son fonctionnement et ses mécanismes dans l'industrie du jeu vidéo. Grâce à mes compétences en Unreal Engine, j'ai la capacité de concevoir et de développer des fonctionnalités de jeu, comme les systèmes de déplacement, de dialogue, de physique et d'effets visuels. J'utilise les fonctionnalités d'Unreal Engine, telles que Blueprint et l'éditeur de niveau, pour créer de petits jeux vidéo pour mon plaisir."
  },
  {
    "id":9,
    "displayName": "miro",
    "iconUrl": "https://seeklogo.com/images/M/miro-logo-4F00416377-seeklogo.com.png",
    "category": "productivité",
    "level": 90,
    "color":"#ffd02f",
    "description": "Miro est une plateforme de collaboration en ligne qui permet aux équipes de travailler conjointement en temps réel sur des projets, tels que des diagrammes, des maquettes, des flux de travail, et bien plus encore. Dans le cadre de mes expériences, j'ai utilisé Miro pour améliorer la collaboration entre différents membres de l'équipe ainsi que les parties prenantes dans le cadre de projets de conception. J'ai également tiré parti de Miro pour créer des diagrammes de flux de travail afin d'optimiser les projets en cours de développement."
  }

]
